cmsis-svd/cmsis-svd/data/Microchip/ATSAMD21GxAU.svd
        <register>
          <name>EVCTRL</name>
          <description>Event Control</description>
          <addressOffset>0x14</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>STARTEI</name>
              <description>Start Conversion Event In</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SYNCEI</name>
              <description>Synchronization Event In</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RESRDYEO</name>
              <description>Result Ready Event Out</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WINMONEO</name>
              <description>Window Monitor Event Out</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INTENCLR</name>
          <description>Interrupt Enable Clear</description>
          <addressOffset>0x16</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>RESRDY</name>
              <description>Result Ready Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OVERRUN</name>
              <description>Overrun Interrupt Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WINMON</name>
              <description>Window Monitor Interrupt Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SYNCRDY</name>
              <description>Synchronization Ready Interrupt Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INTENSET</name>
          <description>Interrupt Enable Set</description>
          <addressOffset>0x17</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>RESRDY</name>
              <description>Result Ready Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OVERRUN</name>
              <description>Overrun Interrupt Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WINMON</name>
              <description>Window Monitor Interrupt Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SYNCRDY</name>
              <description>Synchronization Ready Interrupt Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INTFLAG</name>
          <description>Interrupt Flag Status and Clear</description>
          <addressOffset>0x18</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>RESRDY</name>
              <description>Result Ready</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OVERRUN</name>
              <description>Overrun</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WINMON</name>
              <description>Window Monitor</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SYNCRDY</name>
              <description>Synchronization Ready</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS</name>
          <description>Status</description>
          <addressOffset>0x19</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>SYNCBUSY</name>
              <description>Synchronization Busy</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RESULT</name>
          <description>Result</description>
          <addressOffset>0x1A</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>RESULT</name>
              <description>Result Conversion Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WINLT</name>
          <description>Window Monitor Lower Threshold</description>
          <addressOffset>0x1C</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>WINLT</name>
              <description>Window Lower Threshold</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WINUT</name>
          <description>Window Monitor Upper Threshold</description>
          <addressOffset>0x20</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>WINUT</name>
              <description>Window Upper Threshold</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GAINCORR</name>
          <description>Gain Correction</description>
          <addressOffset>0x24</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>GAINCORR</name>
              <description>Gain Correction Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OFFSETCORR</name>
          <description>Offset Correction</description>
          <addressOffset>0x26</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>OFFSETCORR</name>
              <description>Offset Correction Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CALIB</name>
          <description>Calibration</description>
          <addressOffset>0x28</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>LINEARITY_CAL</name>
              <description>Linearity Calibration Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>BIAS_CAL</name>
              <description>Bias Calibration Value</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DBGCTRL</name>
          <description>Debug Control</description>
          <addressOffset>0x2A</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>DBGRUN</name>
              <description>Debug Run</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
