cmsis-svd/cmsis-svd/data/Microchip/ATSAMD21GxAU.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>PAC0</name>
      <version>1.0.1</version>
      <description>Peripheral Access Controller 0</description>
      <groupName>PAC</groupName>
      <prependToName>PAC_</prependToName>
      <baseAddress>0x40000000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x08</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>WPCLR</name>
          <description>Write Protection Clear</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>WP</name>
              <description>Write Protection Clear</description>
              <bitOffset>1</bitOffset>
              <bitWidth>31</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WPSET</name>
          <description>Write Protection Set</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>WP</name>
              <description>Write Protection Set</description>
              <bitOffset>1</bitOffset>
              <bitWidth>31</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral derivedFrom="PAC0">
      <name>PAC1</name>
      <description>Peripheral Access Controller 1</description>
      <baseAddress>0x41000000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="PAC0">
      <name>PAC2</name>
      <description>Peripheral Access Controller 2</description>
      <baseAddress>0x42000000</baseAddress>
    </peripheral>
    <peripheral>
      <name>PM</name>
      <version>2.0.1</version>
      <description>Power Manager</description>
      <groupName>PM</groupName>
      <prependToName>PM_</prependToName>
      <baseAddress>0x40000400</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x80</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>PM</name>
        <value>0</value>
      </interrupt>
      <registers>
        <register>
          <name>CTRL</name>
          <description>Control</description>
          <addressOffset>0x00</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>SLEEP</name>
          <description>Sleep Mode</description>
          <addressOffset>0x01</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>IDLE</name>
              <description>Idle Mode Configuration</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>IDLESelect</name>
                <enumeratedValue>
                  <name>CPU</name>
                  <description>The CPU clock domain is stopped</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AHB</name>
                  <description>The CPU and AHB clock domains are stopped</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APB</name>
                  <description>The CPU, AHB and APB clock domains are stopped</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CPUSEL</name>
          <description>CPU Clock Select</description>
          <addressOffset>0x08</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>CPUDIV</name>
              <description>CPU Prescaler Selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <name>CPUDIVSelect</name>
                <enumeratedValue>
                  <name>DIV1</name>
                  <description>Divide by 1</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV2</name>
                  <description>Divide by 2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV4</name>
                  <description>Divide by 4</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV8</name>
                  <description>Divide by 8</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV16</name>
                  <description>Divide by 16</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV32</name>
                  <description>Divide by 32</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV64</name>
                  <description>Divide by 64</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV128</name>
                  <description>Divide by 128</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>APBASEL</name>
          <description>APBA Clock Select</description>
          <addressOffset>0x09</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>APBADIV</name>
              <description>APBA Prescaler Selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <name>APBADIVSelect</name>
                <enumeratedValue>
                  <name>DIV1</name>
                  <description>Divide by 1</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV2</name>
                  <description>Divide by 2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV4</name>
                  <description>Divide by 4</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV8</name>
                  <description>Divide by 8</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV16</name>
                  <description>Divide by 16</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV32</name>
                  <description>Divide by 32</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV64</name>
                  <description>Divide by 64</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV128</name>
                  <description>Divide by 128</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>APBBSEL</name>
          <description>APBB Clock Select</description>
          <addressOffset>0x0A</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>APBBDIV</name>
              <description>APBB Prescaler Selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <name>APBBDIVSelect</name>
                <enumeratedValue>
                  <name>DIV1</name>
                  <description>Divide by 1</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV2</name>
                  <description>Divide by 2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV4</name>
                  <description>Divide by 4</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV8</name>
                  <description>Divide by 8</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV16</name>
                  <description>Divide by 16</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV32</name>
                  <description>Divide by 32</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV64</name>
                  <description>Divide by 64</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV128</name>
                  <description>Divide by 128</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>APBCSEL</name>
          <description>APBC Clock Select</description>
          <addressOffset>0x0B</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>APBCDIV</name>
              <description>APBC Prescaler Selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <name>APBCDIVSelect</name>
                <enumeratedValue>
                  <name>DIV1</name>
                  <description>Divide by 1</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV2</name>
                  <description>Divide by 2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV4</name>
                  <description>Divide by 4</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV8</name>
                  <description>Divide by 8</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV16</name>
                  <description>Divide by 16</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV32</name>
                  <description>Divide by 32</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV64</name>
                  <description>Divide by 64</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV128</name>
                  <description>Divide by 128</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>AHBMASK</name>
          <description>AHB Mask</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <resetValue>0x0000007F</resetValue>
          <fields>
            <field>
              <name>HPB0_</name>
              <description>HPB0 AHB Clock Mask</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HPB1_</name>
              <description>HPB1 AHB Clock Mask</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HPB2_</name>
              <description>HPB2 AHB Clock Mask</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DSU_</name>
              <description>DSU AHB Clock Mask</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NVMCTRL_</name>
              <description>NVMCTRL AHB Clock Mask</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DMAC_</name>
              <description>DMAC AHB Clock Mask</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USB_</name>
              <description>USB AHB Clock Mask</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>APBAMASK</name>
          <description>APBA Mask</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <resetValue>0x0000007F</resetValue>
          <fields>
            <field>
              <name>PAC0_</name>
              <description>PAC0 APB Clock Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PM_</name>
              <description>PM APB Clock Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SYSCTRL_</name>
              <description>SYSCTRL APB Clock Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GCLK_</name>
              <description>GCLK APB Clock Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WDT_</name>
              <description>WDT APB Clock Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RTC_</name>
              <description>RTC APB Clock Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EIC_</name>
              <description>EIC APB Clock Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>APBBMASK</name>
          <description>APBB Mask</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <resetValue>0x0000007F</resetValue>
          <fields>
            <field>
              <name>PAC1_</name>
              <description>PAC1 APB Clock Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DSU_</name>
              <description>DSU APB Clock Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NVMCTRL_</name>
              <description>NVMCTRL APB Clock Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PORT_</name>
              <description>PORT APB Clock Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DMAC_</name>
              <description>DMAC APB Clock Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USB_</name>
              <description>USB APB Clock Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HMATRIX_</name>
              <description>HMATRIX APB Clock Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>APBCMASK</name>
          <description>APBC Mask</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <resetValue>0x00010000</resetValue>
          <fields>
            <field>
              <name>PAC2_</name>
              <description>PAC2 APB Clock Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EVSYS_</name>
              <description>EVSYS APB Clock Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SERCOM0_</name>
              <description>SERCOM0 APB Clock Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SERCOM1_</name>
              <description>SERCOM1 APB Clock Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SERCOM2_</name>
              <description>SERCOM2 APB Clock Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SERCOM3_</name>
              <description>SERCOM3 APB Clock Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SERCOM4_</name>
              <description>SERCOM4 APB Clock Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SERCOM5_</name>
              <description>SERCOM5 APB Clock Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TCC0_</name>
              <description>TCC0 APB Clock Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TCC1_</name>
              <description>TCC1 APB Clock Enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TCC2_</name>
              <description>TCC2 APB Clock Enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TC3_</name>
              <description>TC3 APB Clock Enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TC4_</name>
              <description>TC4 APB Clock Enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TC5_</name>
              <description>TC5 APB Clock Enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TC6_</name>
              <description>TC6 APB Clock Enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TC7_</name>
              <description>TC7 APB Clock Enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ADC_</name>
              <description>ADC APB Clock Enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AC_</name>
              <description>AC APB Clock Enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DAC_</name>
              <description>DAC APB Clock Enable</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PTC_</name>
              <description>PTC APB Clock Enable</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I2S_</name>
              <description>I2S APB Clock Enable</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INTENCLR</name>
          <description>Interrupt Enable Clear</description>
          <addressOffset>0x34</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>CKRDY</name>
              <description>Clock Ready Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INTENSET</name>
          <description>Interrupt Enable Set</description>
          <addressOffset>0x35</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>CKRDY</name>
              <description>Clock Ready Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
